package by.it.group351001.semashka_iv.lesson04.lesson06;

import java.io.FileNotFoundException;
import java.io.InputStream;
import java.util.Scanner;

/*
Задача на программирование: наибольшая кратная подпоследовательность

Дано:
    целое число 1≤n≤1000
    массив A[1…n] натуральных чисел, не превосходящих 2E9.

Необходимо:
    Выведите максимальное 1<=k<=n, для которого гарантированно найдётся
    подпоследовательность индексов i[1]<i[2]<…<i[k] <= длины k,
    для которой каждый элемент A[i[k]] делится на предыдущий
    т.е. для всех 1<=j<k, A[i[j+1]] делится на A[i[j]].

Решить задачу МЕТОДАМИ ДИНАМИЧЕСКОГО ПРОГРАММИРОВАНИЯ

    Sample Input:
    4
    3 6 7 12

    Sample Output:
    3
*/

public class B_LongDivComSubSeq {


    public static void main(String[] args) throws FileNotFoundException {
        InputStream stream = B_LongDivComSubSeq.class.getResourceAsStream("dataB.txt");
        B_LongDivComSubSeq instance = new B_LongDivComSubSeq();
        int result = instance.getDivSeqSize(stream);
        System.out.print(result);
    }

    int getDivSeqSize(InputStream stream) throws FileNotFoundException {
        //подготовка к чтению данных
        Scanner scanner = new Scanner(stream);
        //!!!!!!!!!!!!!!!!!!!!!!!!!     НАЧАЛО ЗАДАЧИ     !!!!!!!!!!!!!!!!!!!!!!!!!

/*Подготовка к чтению данных:
Изначально считывается длина последовательности n и сама последовательность m.

Инициализация массива динамического программирования:
Создается массив d, где d[i] представляет собой длину наибольшей кратной подпоследовательности,
заканчивающейся на элементе m[i]. Изначально все элементы массива d инициализируются значением 1,
так как наихудшим случаем будет подпоследовательность, состоящая из одного элемента.

Решение задачи: Для каждого элемента m[i] вычисляется длина наибольшей кратной подпоследовательности,
заканчивающейся на этом элементе. Это делается путем перебора всех элементов, предшествующих m[i],
и проверки, делится ли текущий элемент m[i] на предыдущий элемент m[j].
Если делится, и длина подпоследовательности до m[j] плюс один больше,
чем длина подпоследовательности до m[i], то обновляется значение d[i].

Нахождение максимальной длины:
Во время вычислений ведется отслеживание максимальной длины найденной кратной подпоследовательности,
которая и будет результатом задачи.

Возврат результата:
После завершения вычислений возвращается найденная максимальная длина кратной подпоследовательности.*/

        //общая длина последовательности
        int n = scanner.nextInt();
        int[] m = new int[n];
        int[] d = new int[n];
        //читаем всю последовательность
        for (int i = 0; i < n; i++) {
            m[i] = scanner.nextInt();
            d[i] = 1;
        }
        int result = 0;
        for (int i = 0; i < n; i++) {
            for (int j = 0; j < i; j++) {
                if ((m[i] % m[j]==0)&&(d[j]+1>d[i])){
                    d[i] = d[j] + 1;
                    if (d[i]>result){
                        result = d[i];
                    }
                }

            }
        }

        //!!!!!!!!!!!!!!!!!!!!!!!!!     КОНЕЦ ЗАДАЧИ     !!!!!!!!!!!!!!!!!!!!!!!!!
        return result;
    }

}