package by.it.group310901.eremeiko.lesson01;

/*
 * Даны целые числа 1<=n<=1E18 и 2<=m<=1E5,
 * необходимо найти остаток от деления n-го числа Фибоначчи на m.
 * время расчета должно быть не более 2 секунд
 */

public class FiboC {

    private final long startTime = System.currentTimeMillis();

    private long time() {
        return System.currentTimeMillis() - startTime;
    }

    public static void main(String[] args) {
        FiboC fibo = new FiboC();
        int n = 10;
        int m = 2;
        System.out.printf("fasterC(%d)=%d \n\t time=%d \n\n", n, fibo.fasterC(n, m), fibo.time());
    }

    long fasterC(long n, int m) {
        //Решение сложно найти интуитивно
        //возможно потребуется дополнительный поиск информации
        //см. период Пизано

        // Если n меньше или равно 1, возвращаем остаток от деления n на m
        if (n <= 1) {
            return n % m;
        }
        long prev = 0;  // Начинаем с нуля
        long curr = 1;  // Затем идет единица
        long result = 0;   // Это будет результатом нашего вычисления

        // Проходимся по всем числам от 2 до n
        for (int i = 2; i <= n; i++) {
            // Складываем два предыдущих числа и берем остаток от деления на m
            result = (prev + curr) % m;
            // Обновляем числа для следующего шага
            prev = curr;
            curr = result;
            // Если мы видим, что числа начинают повторяться с 0 и 1
            if (prev == 0 && curr == 1) {
                // Мы нашли период повторения, и теперь можем ускорить вычисление
                long period = i - 1;
                int remainder = (int) (n % period);
                // Вместо того чтобы идти до n, мы теперь идем только до остатка
                return fasterC(remainder, m);
            }

        }
        return result;

        /*Этот метод вычисляет остаток от деления n-го числа Фибоначчи на m.
        Если n меньше или равно 1, он возвращает остаток от деления n на m.
        В противном случае он вычисляет каждое последующее число Фибоначчи как сумму
        двух предыдущих чисел и берет остаток от деления на m. Если он обнаруживает повторение
        последовательности 0, 1 (что является началом последовательности Фибоначчи),
        он определяет период Пизано и вычисляет остаток от деления n на этот период.
        Затем он рекурсивно вызывает себя с этим остатком и m.*/
    }


}

